<script setup lang="ts">
import AppCode from '@/components/ui/app-code.vue'
import AppAppSection from '@/components/section/app-section.vue'
import { ref } from 'vue'

const code = ref(`console.log('Hello, world!')`)
</script>

<template>
  <app-app-section title="Дерево">
    <p>
      Дерево — это структура данных, состоящая из узлов, где каждый узел имеет значение и список
      ссылок на дочерние узлы. В frontend-разработке деревья могут быть использованы для
      представления вложенных комментариев к посту.
    </p>

    <app-code :code="code" />

    <p>
      Представьте себе блог, где пользователи могут оставлять комментарии к постам, а также отвечать
      на комментарии других пользователей. Дерево может быть использовано для представления этой
      иерархии комментариев.
    </p>

    <h2>Проблемы деревьев</h2>
    <p>
      Одной из основных проблем деревьев является их балансировка. Несбалансированные деревья могут
      привести к значительному снижению производительности при выполнении операций поиска, вставки и
      удаления. Ключевые слова: вращение деревьев, балансировка деревьев, AVL-дерево
    </p>
  </app-app-section>
</template>
