<script setup lang="ts">
import AppSection from '@/components/section/app-section.vue'
import ModalFlowCase from '@/structures/stack/examples/modal-flow-case.vue'
import TextEditorCase from '@/structures/stack/examples/text-editor-case.vue'
</script>

<template>
  <app-section title="Стек">
    <template #description>
      Стек — это структура данных, работающая по принципу LIFO (Last In, First Out), что означает,
      что последний добавленный элемент будет первым извлечён. В frontend-разработке стек полезен
      для управления историей навигации или для валидации данных.
    </template>
    <template #example1>
      <p>Реализация потока модальных окон</p>
      <p>Представим ситуацию, когда у нас есть два модальных окна:</p>
      <ul>
        <li>Модальное окно удаления аккаунта. Открывается по кнопке "Удалить аккаунт".</li>
        <li>
          Модальное окно подтверждения удаления аккаунта. Открывается после нажатия на кнопку "Да,
          хочу удалить" в первом модальном окне.
        </li>
      </ul>
      <p>
        При этом у нас возникает следующая дилемма: мы хотим написать код, чтобы при нажатии на
        клавишу Esc модальное окно закрывалось, но при обычной реализации, если на обеих модальных
        окнах стоит обработчик закрытия по нажатию Esc, они закроются одновременно. Решение
        заключается в том, чтобы складывать модальные окна в Stack, тогда при нажатии на Esc
        удалится последний элемент из стека, в котором содержатся обе модалки.
      </p>
      <modal-flow-case />
    </template>
  </app-section>
</template>
