<script setup lang="ts">
import AppSection from '@/components/section/app-section.vue'
import ModalFlowCase from '@/structures/stack/examples/modal-flow-case.vue'
</script>

<template>
  <app-section
    title="Стек"
    source="https://github.com/RuSaG0/js-data-structures/tree/master/src/structures/stack"
    :examples="[
      {
        title: 'Последовательные модальные окна',
        link: 'https://github.com/RuSaG0/js-data-structures/blob/master/src/structures/stack/examples/modal-flow-case.vue',
      },
    ]"
  >
    <template #description>
      Стек — это структура данных, работающая по принципу LIFO (Last In, First Out), что означает,
      что последний добавленный элемент будет первым извлечён. Во frontend-разработке стек полезен
      для управления историей навигации или для валидации данных.
      <img src="/structures/stack.svg" alt="" />
    </template>

    <template #pros>
      Когда требуется управление состоянием или выполнение операций по принципу "последний пришёл — первый вышел" (LIFO).
    </template>

    <template #cons>
      Ограниченный доступ (доступен только последний элемент), ограниченная функциональность (не подойдет, когда нужен доступ до определенного элемента), использование памяти (если используется для большого количества данных).
    </template>

    <template #example1>
      <p>Представим ситуацию, когда у нас есть два модальных окна:</p>
      <ul>
        <li>модальное окно удаления аккаунта, открывается по кнопке "Удалить аккаунт";</li>
        <li>
          модальное окно подтверждения удаления аккаунта, открывается после нажатия на кнопку "Да,
          хочу удалить" в первом модальном окне.
        </li>
      </ul>
      <p>
        Мы хотим написать код, чтобы при нажатии на клавишу Esc или при клике вне области модального окна -оно закрывалось,
        но при обычной реализации, если на обеих модальных
        окнах стоит обработчик закрытия по нажатию Esc, они закроются одновременно. Решение
        заключается в том, чтобы складывать модальные окна в Stack, тогда при нажатии на Esc
        удалится последний элемент из стека, в котором содержатся обе модалки. В этом примере у нас в модальных кнопках намеренно сделана только одна кнопка,
        чтобы потребность в нажатии Esc была нагляднее. Может показаться, что пример синтетический,
        но в действительности сложных UX-сценариев, когда вы теряетесь посередине пути и просто хотите вернуться в самое начало,
        гораздо больше, чем вам кажется.
      </p>
      <modal-flow-case />
    </template>
  </app-section>
</template>
